TensorFlowFoam/ML_RANS/YamashinaClosedTF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam_ML;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          10;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
   // #includeFunc "stressComponents"
   // #includeFunc "pressureCoefficient"
   // #includeFunc "sample"
   // #includeFunc "sampleCp"
   // #includeFunc "writeCellCentres"
   // #includeFunc "wallShearStress"
}

libs
(
  "ML_SA_CG.so"
);

// ************************************************************************* //
