TensorFlowFoam/ML_RANS/YamashinaClosedTF/system/meshQualityDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.5
// Source file: C:\Users\justi\Desktop\College\Senior\SeniorThesis\YamashinaClosedSep.blend
// Export date: 2024-02-26 00:19:05.812435

maxNonOrtho     35;
maxBoundarySkewness 20;
maxInternalSkewness 4;
maxConcave      80;
minVol          1e-15;
minTetQuality   1e-15;
minArea         -1;
minTwist        0.05;
minDeterminant  0.001;
minFaceWeight   0.05;
minVolRatio     0.01;
minTriangleTwist 0.6;

// Relaxed quality criteria for layer addition phase

relaxed {
    maxNonOrtho 75;
    minTriangleTwist 0.5;
    minTetQuality -1e+30;
}
